tutorials/immersedBoundary/pitzDailyLaminarIcoIbFoam/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.019  -0.03 -0.002)
    ( 0.285 -0.03 -0.002)
    ( 0.285  0.03 -0.002)
    (-0.019   0.03 -0.002)

    (-0.019   -0.03  0.002)
    ( 0.285  -0.03  0.002)
    ( 0.285   0.03  0.002)
    (-0.019    0.03  0.002)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (180 34 1) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch top
    (
        (3 7 6 2)
    )
    patch inlet
    (
        (0 4 7 3)
    )
    patch outlet
    (
        (2 6 5 1)
    )
    patch bottom
    (
        (1 5 4 0)
    )
    empty frontAndBack
    (
        (0 3 2 1)
        (4 5 6 7)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
